
#1) for ციკლის გამოყენებით დაბეჭდეთ 0 დან 10-ის ჩათვლით კენტი რიცხვები
for i in range(1,11,2):
    print(i)

#2) შექმენით პროგრამა, რომელიც ბეჭდავს 5-ის ჯერადებს(რიცხვები რომლებიც იყოფა 5ზე) 1-დან 50-ის ჩათვლით for ციკლის გამოყენებით.
for i in range(1,51):
    if i % 5 == 0:
        print(i)

#3)მომხმარებელს შეეკითხეთ რომ შემოიტანოს მთელი რიცხვი. შემდეგ 0-დან ამ რიცხვამდე გამოიტანეთ ყველა  რიცხვი.
num1 = int(input("please enter your number"))
for i in range(0,num1):
    print(i)

#4) 0დან 50-მდე გამოიტანეთ რიცხვები და ბოლოს მათი ჯამი
total = 0 
for i in range(0,50):
    print(i)
    total += i
    print(total)






